<?php

namespace Hosseinizadeh\Gateway\Snapppay;

use Hosseinizadeh\Gateway\Exceptions\BankException;

class SnapppayException extends BankException
{
    public static $errors = array(
        1000 => "در دریافت اطلاعات مشکلی پیش آمده است. لطفاً دوباره تلاش کنید.",
        1005 => "مقدار با الگوی \"+98\d{10}\" همخوانی ندارد",
        1009 => "تراکنش تکراری است.",
        1051 => "آدرس بازگشت به سایت معتبر نمی‌باشد.",
        1011 => "وضعیت تراکنش برای عملیات موردنظر نامناسب است.",
        1053 => "ثبت درخواست جدید ممکن نیست. لطفاً چند لحظهٔ دیگر دوباره تلاش کنید.",
        1048 => "متاسفانه در حال حاضر امکان استفاده از سرویس اعتباری را ندارید. برای اطلاعات بیشتر به سرویس اعتباری در اپلیکیشن اسنپ مراجعه کنید.",
        100 => "اطلاعات مورد نظر پیدا نشد.",
        1007 => "اطلاعات مورد نظر پیدا نشد.",
        1036 => "برای تراکنش درخواست شده سفارشی یافت نشد.",
        1042 => "مبلغ سفارش جهت به روز رسانی سفارش می بایست کمتر یا مساوی مبلغ سفارش قبلی باشد.",
        1078 => "تغییر در سفارش‌هایی که از کد تخفیف اسنپ‌پی استفاده کرده‌اند ممکن نیست. می‌توانید سفارش را لغو کنید",
    );

    public function __construct($errorId)
    {
        $this->errorId = intval($errorId);

        parent::__construct(@self::$errors[$this->errorId].' #'.$this->errorId, $this->errorId);
    }
}
